pages/7_Homework.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>The Drawer Alarm</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" type="text/css" href="css/styles.css"/>
<link href='http://fonts.googleapis.com/css?family=Ubuntu+Mono|Ubuntu' rel='stylesheet' type='text/css'>
</head>
<body>
<div id="content">
<h1 class="title">The Drawer Alarm</h1>
  <div class="github-fork-ribbon-wrapper left">
    <div class="github-fork-ribbon">
      <a href="https://github.com/stcd11/9-SC-Alarm">Fork me on GitHub</a>
    </div>
  </div>
<div id="stickyribbon">
    <ul>
      <li><a href="1_Lesson.html">Week1</a></li>
      <li><a href="2_Lesson.html">Week2</a></li>
      <li><a href="3_Lesson.html">Week3</a></li>
      <li><a href="4_Lesson.html">Week4</a></li>
      <li><a href="5_Lesson.html">Week5</a></li>
      <li><a href="6_Lesson.html">Week6</a></li>
      <li><a href="assessment.html">Assessment</a></li>
    </ul>
  </div>

<div id="outline-container-sec-1" class="outline-2 activity">
<h2 id="sec-1"><span class="section-number-2">1</span> Homework Tasks</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-sec-1-1" class="outline-3 research">
<h3 id="sec-1-1">1. Sense It</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>The drawer alarm uses a LDR as a sensor to detect when the drawer is open. 
</li>
<li>Research <b>three</b> other types of sensor that could be added to a circuit, and suggest a project they could be used for. 
</li>
<li>For each, find a picture from the web of the sensor.
</li>
<li>E.g. An ultrasonic distance sensor uses ultrasound to detect how far away objects are from it. 
</li>
<li>This could be used to make a reversing sensor for a car.
</li>
<li>Upload your work to the first badge in the homework section.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3 document">
<h3 id="sec-1-2">2. Sound It</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>The drawer alarm uses a small loudspeaker to alert the owner when it is triggered. 
</li>
<li>Read this page: <a href="https://www.bournetoinvent.com/projects/mp3/step_4.html">https://www.bournetoinvent.com/projects/mp3/step_4.html</a> and complete the task described at the bottom.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3 design">
<h3 id="sec-1-3">3. House It</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li>The housing for the drawer alarm is made from laser-cut 3mm acrylic sheet, separated by some nuts and bolts. 
</li>
<li>Sketch designs for two different housings and label them. 
</li>
<li>They’ll still need to have the switch on the front, somewhere for the LDR and two LEDs, but how you design it is up to you. Indicate approximate dimensions. 
</li>
<li>Where will the PCB go? What holds it together? What’s it made from? Where do the batteries go?
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-4" class="outline-3 design">
<h3 id="sec-1-4">4. Test It</h3>
<div class="outline-text-3" id="text-1-4">
<ul class="org-ul">
<li>When products are designed for commercial release, it is essential they are tested.
</li>
<li>There are different types of test:
<ul class="org-ul">
<li>Functional testing ensure that the product does what it should. E.g. A microwave oven should stop emitting microwaves when the time set has run out.
</li>
<li>Performance testing checks that a product performs to a particular standard. E.g. A burlar alarm sensor should be able to detect an intruder from at least 5m away.
</li>
<li>Safety testing ensures that the product is safe to use. E.g. A glass should be inspected to ensure there are no jagged edges.
</li>
<li>Visual inspection will ensure that the product looks correct. E.g. In a box of eggs, none should be broken.
</li>
<li>Durability testing will see if a product will break easily. E.g. A vacuum cleaner should be able to be dropped onto a hard floor from 10cm and still work properly. 
</li>
</ul>
</li>
<li>Answer these questions:
<ul class="org-ul">
<li>Provide at least two reasons why it is important to test an electronic product before mass-producing and selling it.
</li>
<li>Imagine you were a product test engineer for the drawer alarm. Describe four different tests you could conduct to make sure its suitable to be sold. 
</li>
<li>For each test, state the type of test (see above) that you are describing.
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-5" class="outline-3 design">
<h3 id="sec-1-5">5. Material world</h3>
<div class="outline-text-3" id="text-1-5">
<ul class="org-ul">
<li>We tend to use MDF and acrylic in School for much of our making
</li>
<li>We could use lots of other things too, like steel. 
</li>
<li>Materials can be grouped into different types, such as:
<ol class="org-ol">
<li><a href="https://en.wikipedia.org/wiki/Engineered_wood">Man-made boards</a>
</li>
<li><a href="https://en.wikipedia.org/wiki/Hardwood">Hardwoods</a>
</li>
<li><a href="https://en.wikipedia.org/wiki/Softwood">Softwoods</a>
</li>
<li><a href="https://simple.wikipedia.org/wiki/Thermoplastic">Thermoplastics</a>
</li>
<li><a href="https://simple.wikipedia.org/wiki/Thermosetting_polymer">Thermosetting polymers</a>
</li>
<li><a href="http://www.bbc.co.uk/schools/gcsebitesize/design/electronics/materialsrev3.shtml">Ferrous</a> metals
</li>
<li><a href="http://www.bbc.co.uk/schools/gcsebitesize/design/electronics/materialsrev3.shtml">Non-ferrous</a> metals
</li>
</ol>
</li>
<li>Write a brief definition of each of the above.
</li>
<li>Provide an example for each. The first one is done for you. E.g.
</li>
</ul>
<blockquote>
<p>
A man-made board is a material made by combining wood with something else (e.g. glue). An example of this is MDF which is made by mixing sawdust and glue together, then pressing it into flat sheets.
</p>
</blockquote>
</div>
</div>
<div id="outline-container-sec-1-6" class="outline-3 design">
<h3 id="sec-1-6">6. Evaluate it</h3>
<div class="outline-text-3" id="text-1-6">
<ul class="org-ul">
<li>You should now be at the end of this project. 
</li>
<li>To finish up, you will write a short evaluation of your work during this project.
</li>
<li>Write a short evaluation of your performance, considering each of the following:
<ul class="org-ul">
<li>What went well? E.g. Your soldering, your programming work, PCB design?
</li>
<li>What didn't do so well? E.g. Struggled with coding, didn't get the product finished.
</li>
<li>What will you do differently in future projects to improve your performance? E.g. Time management, practice soldering, avoid distraction, etc.
</li>
</ul>
</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="validation"></p>
</div>
</body>
</html>
